Project/Toir/src/InformationRegisters/гкс_ИсторияЗаменыСогласующих/гкс_ИсторияЗаменыСогласующих.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>гкс_ИсторияЗаменыСогласующих</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Отменен</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>СпособСогласования</name>
    <type>
      <types>CatalogRef.торо_СпособыСогласованияДокументов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Заменен</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Установлен</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Project/Toir/src/Catalogs/торо_СпособыСогласованияДокументов/торо_СпособыСогласованияДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>торо_СпособыСогласованияДокументов</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <comment>(Упр)</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ПорядокСогласования</name>
    <attributes>
      <name>Пользователь</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>Порядок</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТекущийСтатус</name>
      <type>
        <types>CatalogRef.торо_СтатусыСогласованияДокументовРемонтныхРабот</types>
      </type>
    </attributes>
    <attributes>
      <name>_Статус</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПроведениеДокумента</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>гкс_ПроводитьАвтоматически</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Замещающие</name>
    <attributes>
      <name>Пользователь</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>Замещающий</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекущийСтатус</name>
      <type>
        <types>CatalogRef.торо_СтатусыСогласованияДокументовРемонтныхРабот</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ОповещаемыеЛица</name>
    <attributes>
      <name>ТекущийСтатус</name>
      <type>
        <types>CatalogRef.торо_СтатусыСогласованияДокументовРемонтныхРабот</types>
      </type>
    </attributes>
    <attributes>
      <name>ОповещаемоеЛицо</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>АдресЭлектроннойПочты</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Project/Toir/src/InformationRegisters/гкс_ИсторияЗаменыСогласующих/Forms/РМЗаменыСогласующих/Module.bsl
&НаСервере
Процедура ЗаменитьНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ТаблицаСправочника.Ссылка КАК Ссылка,
		|	ТаблицаСправочника.Пользователь КАК Пользователь
		|ПОМЕСТИТЬ ВсеНайденные
		|ИЗ
		|	Справочник.торо_СпособыСогласованияДокументов.ПорядокСогласования КАК ТаблицаСправочника
		|Где &Заменяемый = ТаблицаСправочника.Пользователь
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ТаблицаСправочника.Ссылка,
		|	ТаблицаСправочника.Замещающий
		|ИЗ
		|	Справочник.торо_СпособыСогласованияДокументов.Замещающие КАК ТаблицаСправочника
		|Где &Заменяемый = ТаблицаСправочника.Замещающий
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВсеНайденные.Ссылка КАК Ссылка,
		|	ВсеНайденные.Пользователь КАК Пользователь
		|ИЗ
		|	ВсеНайденные КАК ВсеНайденные
		|ИТОГИ ПО
		|	Ссылка";
	Запрос.УстановитьПараметр("Заменяемый", Заменяемый);
	РезультатЗапроса = Запрос.Выполнить();
	УспешныхЗамен = 0;
	Если Не РезультатЗапроса.Пустой() Тогда 
		ДатаНачалаЗамены = ТекущаяДата();
		ВыборкаСсылка = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаСсылка.Следующий() Цикл
			Выборка = ВыборкаСсылка.Выбрать();
			НачатьТранзакцию();
			Попытка
				Пока Выборка.Следующий() Цикл
					НовыйНаборЗаписей = РегистрыСведений.гкс_ИсторияЗаменыСогласующих.СоздатьНаборЗаписей();
					НовыйНаборЗаписей.Отбор.СпособСогласования.Установить(Выборка.Ссылка);
					НовыйНаборЗаписей.Отбор.Период.Установить(ДатаНачалаЗамены);
					НовыйНаборЗаписей.Отбор.Заменен.Установить(Заменяемый);
					НовыйНаборЗаписей.Отбор.Установлен.Установить(Устанавливаемый);
					НоваяСтрока = НовыйНаборЗаписей.Добавить();
					НоваяСтрока.Период = ДатаНачалаЗамены;
					НоваяСтрока.СпособСогласования = Выборка.Ссылка;
					НоваяСтрока.Заменен = Заменяемый;
					НоваяСтрока.Установлен = Устанавливаемый;
					НовыйНаборЗаписей.Записать();
				КонецЦикла;
				СпрОбъект = ВыборкаСсылка.Ссылка.ПолучитьОбъект();
				Для Каждого СтрокаТаблицы Из СпрОбъект.ПорядокСогласования Цикл
					Если СтрокаТаблицы.Пользователь = Заменяемый Тогда 
						СтрокаТаблицы.Пользователь = Устанавливаемый;
					КонецЕсли;
				КонецЦикла;
				Для Каждого СтрокаТаблицы Из СпрОбъект.Замещающие Цикл
					Если СтрокаТаблицы.Замещающий = Заменяемый Тогда 
						СтрокаТаблицы.Замещающий = Устанавливаемый;
					КонецЕсли;
				КонецЦикла;
				// гкс+ [12.22] Деснол 12.12.2022
				Для Каждого СтрокаТаблицы Из СпрОбъект.Замещающие Цикл
					Если СтрокаТаблицы.Пользователь = Заменяемый Тогда 
						СтрокаТаблицы.Пользователь = Устанавливаемый;
					КонецЕсли;
				КонецЦикла;
				// гкс- [12.22] Деснол 12.12.2022
				СпрОбъект.Записать();
				ЗафиксироватьТранзакцию();
				УспешныхЗамен = УспешныхЗамен + 1;
			Исключение
				ОтменитьТранзакцию();
				Сообщение = Новый СообщениеПользователю();
				Сообщение.Текст = ОписаниеОшибки();
				Сообщение.Сообщить();
			КонецПопытки;
		КонецЦикла;
	КонецЕсли;
	Если УспешныхЗамен > 0 Тогда 
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = "Изменено [" + УспешныхЗамен + "] способов согласования";
		Сообщение.Сообщить();
	Иначе
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = "Не найдено пользователей для замены";
		Сообщение.Сообщить();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Заменить(Команда)
	Если Не ЗначениеЗаполнено(Заменяемый) Тогда 
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = "Не заполнен реквизит";
		Сообщение.Поле = "Заменяемый";
		Сообщение.Сообщить();
		Возврат;
	КонецЕсли;
	Если Не ЗначениеЗаполнено(Устанавливаемый) Тогда 
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = "Не заполнен реквизит";
		Сообщение.Поле = "Устанавливаемый";
		Сообщение.Сообщить();
		Возврат;
	КонецЕсли;
	Если Устанавливаемый = Заменяемый Тогда 
		Устанавливаемый = Неопределено;
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = "Не заполнен реквизит";
		Сообщение.Поле = "Устанавливаемый";
		Сообщение.Сообщить();
		Возврат;
	КонецЕсли;
	ЗаменитьНаСервере();
	Элементы.СписокИстория.Обновить();
КонецПроцедуры

&НаКлиенте
Процедура ОтменитьЗамену(Команда)
	ТекДанные = Элементы.СписокИстория.ТекущиеДанные;
	Если Не ТекДанные = Неопределено Тогда 
		ОтменитьЗаменуНаСервере(ТекДанные.Заменен, ТекДанные.Установлен, ТекДанные.Период);
		Элементы.СписокИстория.Обновить();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ОтменитьЗаменуНаСервере(Заменен, Установлен, Период)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	гкс_ИсторияЗаменыСогласующих.СпособСогласования КАК Ссылка
		|ИЗ
		|	РегистрСведений.гкс_ИсторияЗаменыСогласующих КАК гкс_ИсторияЗаменыСогласующих
		|ГДЕ
		|	гкс_ИсторияЗаменыСогласующих.Период = &Период
		|	И гкс_ИсторияЗаменыСогласующих.Заменен = &Заменен
		|	И гкс_ИсторияЗаменыСогласующих.Установлен = &Установлен
		|	И гкс_ИсторияЗаменыСогласующих.Отменен = ЛОЖЬ";
	
	Запрос.УстановитьПараметр("Заменен", Заменен);
	Запрос.УстановитьПараметр("Период", Период);
	Запрос.УстановитьПараметр("Установлен", Установлен);
	
	УспешныхЗамен = 0;
	РезультатЗапроса = Запрос.Выполнить();
	Если Не РезультатЗапроса.Пустой() Тогда 
		Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл
			НачатьТранзакцию();
			Попытка
				НовыйНаборЗаписей = РегистрыСведений.гкс_ИсторияЗаменыСогласующих.СоздатьНаборЗаписей();
				НовыйНаборЗаписей.Отбор.СпособСогласования.Установить(Выборка.Ссылка);
				НовыйНаборЗаписей.Отбор.Период.Установить(Период);
				НовыйНаборЗаписей.Отбор.Заменен.Установить(Заменен);
				НовыйНаборЗаписей.Отбор.Установлен.Установить(Установлен);
				НовыйНаборЗаписей.Записать();
				СпрОбъект = Выборка.Ссылка.ПолучитьОбъект();
				Для Каждого СтрокаТаблицы Из СпрОбъект.ПорядокСогласования Цикл
					Если СтрокаТаблицы.Пользователь = Установлен Тогда 
						СтрокаТаблицы.Пользователь = Заменен;
					КонецЕсли;
				КонецЦикла;
				Для Каждого СтрокаТаблицы Из СпрОбъект.Замещающие Цикл
					Если СтрокаТаблицы.Замещающий = Установлен Тогда 
						СтрокаТаблицы.Замещающий = Заменен;
					КонецЕсли;
				КонецЦикла;
				// гкс+ [12.22] Деснол 12.12.2022
				Для Каждого СтрокаТаблицы Из СпрОбъект.Замещающие Цикл
					Если СтрокаТаблицы.Пользователь = Установлен Тогда 
						СтрокаТаблицы.Пользователь = Заменен;
					КонецЕсли;
				КонецЦикла;
				// гкс- [12.22] Деснол 12.12.2022
				СпрОбъект.Записать();
				ЗафиксироватьТранзакцию();
				УспешныхЗамен = УспешныхЗамен + 1;
			Исключение
				ОтменитьТранзакцию();
				Сообщение = Новый СообщениеПользователю();
				Сообщение.Текст = ОписаниеОшибки();
				Сообщение.Сообщить();
			КонецПопытки;
		КонецЦикла;
	КонецЕсли;
	Если УспешныхЗамен > 0 Тогда 
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = "Изменено [" + УспешныхЗамен + "] способов согласования";
		Сообщение.Сообщить();
	Иначе
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = "Не найдено пользователей для замены";
		Сообщение.Сообщить();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ДобавитьПользователяНаСервере()
	Запрос = Новый Запрос();
	Запрос.Текст = "ВЫБРАТЬ
	               |	ТЧ.Ссылка КАК Ссылка
	               |ПОМЕСТИТЬ Исходные
	               |ИЗ
	               |	&ТЧ1 КАК ТЧ
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	Исходные.Ссылка КАК Ссылка
	               |ИЗ
	               |	Исходные КАК Исходные";
	Запрос.УстановитьПараметр("ТЧ1", ТабСпособов.Выгрузить());
	РезультатЗапроса = Запрос.Выполнить();
	ТабСпособов.Загрузить(РезультатЗапроса.Выгрузить());
	Для Каждого СТ Из ТабСпособов Цикл
		Если Не ЗначениеЗаполнено(СТ.Ссылка) Тогда 
			Продолжить;
		КонецЕсли;
		ЕстьИзменения = Ложь;
		СпрОбъект = СТ.Ссылка.ПолучитьОбъект();
		Для Каждого СтрокаСтатус Из ТабСтатусов Цикл
			НайдСтроки = СпрОбъект.ПорядокСогласования.НайтиСтроки(Новый Структура("ТекущийСтатус", СтрокаСтатус.Статус));
			Если НайдСтроки.Количество() = 0 Тогда
				НоваяСтрока = СпрОбъект.ПорядокСогласования.Добавить();
				НоваяСтрока.Пользователь = Добавляемый;
				НоваяСтрока.ТекущийСтатус = СтрокаСтатус.Статус;
				ЕстьИзменения = Истина;
			Иначе
				НоваяСтрока = СпрОбъект.Замещающие.Добавить();
				НоваяСтрока.Пользователь = НайдСтроки[0].Пользователь;
				НоваяСтрока.Замещающий = Добавляемый;
				НоваяСтрока.ТекущийСтатус = СтрокаСтатус.Статус;
				ЕстьИзменения = Истина;
			КонецЕсли;
		КонецЦикла;
		Если ЕстьИзменения = Истина Тогда 
			СпрОбъект.Записать();
		КонецЕсли;
	КонецЦикла;
	
	Сообщение = Новый СообщениеПользователю();
	Сообщение.Текст = "Добавление завершено";
	Сообщение.Сообщить();
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьПользователя(Команда)
	Если ТабСпособов.Количество() = 0 Тогда 
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = "Не выбраны способы согласования";
		Сообщение.Сообщить();
		Возврат;
	КонецЕсли;
	Если ТабСтатусов.Количество() = 0 Тогда 
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = "Не выбраны статусы";
		Сообщение.Сообщить();
		Возврат;
	КонецЕсли;
	ДобавитьПользователяНаСервере();
КонецПроцедуры
